apache/nuttx/arch/arm/src/sam34/chip/sam_smc.h
/****************************************************************************************
 * arch/arm/src/sam34/chip/sam_smc.h
 * Static Memory Controller (SMC) definitions for the SAM3U, SAM4E, and SAM4S
 *
 *   Copyright (C) 2009, 2013-2014 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************/

#ifndef __ARCH_ARM_SRC_SAM34_CHIP_SAM_SMC_H
#define __ARCH_ARM_SRC_SAM34_CHIP_SAM_SMC_H

/****************************************************************************************
 * Included Files
 ****************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "chip/sam_memorymap.h"

/****************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************/

/* SMC register offsets *****************************************************************/

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SAM_SMC_CFG_OFFSET           0x0000 /* SMC NFC Configuration Register */
#  define SAM_SMC_CTRL_OFFSET          0x0004 /* SMC NFC Control Register */
#  define SAM_SMC_SR_OFFSET            0x0008 /* SMC NFC Status Register */
#  define SAM_SMC_IER_OFFSET           0x000c /* SMC NFC Interrupt Enable Register */
#  define SAM_SMC_IDR_OFFSET           0x0010 /* SMC NFC Interrupt Disable Register */
#  define SAM_SMC_IMR_OFFSET           0x0014 /* SMC NFC Interrupt Mask Register */
#  define SAM_SMC_ADDR_OFFSET          0x0018 /* SMC NFC Address Cycle Zero Register */
#  define SAM_SMC_BANK_OFFSET          0x001c /* SMC Bank Address Register */
#  define SAM_SMC_ECCCTRL_OFFSET       0x0020 /* SMC ECC Control Register */
#  define SAM_SMC_ECCMD_OFFSET         0x0024 /* SMC ECC Mode Register */
#  define SAM_SMC_ECCSR1_OFFSET        0x0028 /* SMC ECC Status 1 Register */
#  define SAM_SMC_ECCPR0_OFFSET        0x002c /* SMC ECC parity 0 Register */
#  define SAM_SMC_ECCPR1_OFFSET        0x0030 /* SMC ECC parity 1 Register */
#  define SAM_SMC_ECCSR2_OFFSET        0x0034 /* SMC ECC status 2 Register */
#  define SAM_SMC_ECCPR2_OFFSET        0x0038 /* SMC ECC parity 2 Register */
#  define SAM_SMC_ECCPR3_OFFSET        0x003c /* SMC ECC parity 3 Register */
#  define SAM_SMC_ECCPR4_OFFSET        0x0040 /* SMC ECC parity 4 Register */
#  define SAM_SMC_ECCPR5_OFFSET        0x0044 /* SMC ECC parity 5 Register */
#  define SAM_SMC_ECCPR6_OFFSET        0x0048 /* SMC ECC parity 6 Register */
#  define SAM_SMC_ECCPR7_OFFSET        0x004c /* SMC ECC parity 7 Register */
#  define SAM_SMC_ECCPR8_OFFSET        0x0050 /* SMC ECC parity 8 Register */
#  define SAM_SMC_ECCPR9_OFFSET        0x0054 /* SMC ECC parity 9 Register */
#  define SAM_SMC_ECCPR10_OFFSET       0x0058 /* SMC ECC parity 10 Register */
#  define SAM_SMC_ECCPR11_OFFSET       0x005c /* SMC ECC parity 11 Register */
#  define SAM_SMC_ECCPR12_OFFSET       0x0060 /* SMC ECC parity 12 Register */
#  define SAM_SMC_ECCPR13_OFFSET       0x0064 /* SMC ECC parity 13 Register */
#  define SAM_SMC_ECCPR14_OFFSET       0x0068 /* SMC ECC parity 14 Register */
#  define SAM_SMC_ECCPR15_OFFSET       0x006c /* SMC ECC parity 15 Register */

#  define SAM_SMCCS_OFFSET(n)          (0x0070+((n)*0x014))
#    define SAM_SMCCS0_OFFSET          0x0070 /* SMC CS0 offset */
#    define SAM_SMCCS1_OFFSET          0x0084 /* SMC CS1 offset */
#    define SAM_SMCCS2_OFFSET          0x0098 /* SMC CS2 offset */
#    define SAM_SMCCS3_OFFSET          0x00ac /* SMC CS3 offset */

#  define SAM_SMCCS_SETUP_OFFSET       0x0000 /* SMC Setup register */
#  define SAM_SMCCS_PULSE_OFFSET       0x0004 /* SMC Pulse Register */
#  define SAM_SMCCS_CYCLE_OFFSET       0x0008 /* SMC Cycle Register */
#  define SAM_SMCCS_TIMINGS_OFFSET     0x000c /* SMC Timings Register */
#  define SAM_SMCCS_MODE_OFFSET        0x0010 /* SMC Mode Register */

#  define SAM_SMC_OCMS_OFFSET          0x0110 /* SMC OCMS Mode Register */
#  define SAM_SMC_KEY1_OFFSET          0x0114 /* SMC KEY1 Register */
#  define SAM_SMC_KEY2_OFFSET          0x0118 /* SMC KEY2 Register */
#  define SAM_SMC_WPCR_OFFSET          0x01e4 /* Write Protection Control Register */
#  define SAM_SMC_WPSR_OFFSET          0x01e8 /* Write Protection Status Register */

#elif defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_SMCCS_OFFSET(n)          ((n) << 4)
#    define SAM_SMCCS0_OFFSET          0x0000 /* SMC CS0 offset */
#    define SAM_SMCCS1_OFFSET          0x0010 /* SMC CS1 offset */
#    define SAM_SMCCS2_OFFSET          0x0020 /* SMC CS2 offset */
#    define SAM_SMCCS3_OFFSET          0x0030 /* SMC CS3 offset */

#  define SAM_SMCCS_SETUP_OFFSET       0x0000 /* SMC Setup Register */
#  define SAM_SMCCS_PULSE_OFFSET       0x0004 /* SMC Pulse Register */
#  define SAM_SMCCS_CYCLE_OFFSET       0x0008 /* SMC Cycle Register */
#  define SAM_SMCCS_MODE_OFFSET        0x000c /* SMC Mode Register */

#  define SAM_SMC_OCMS_OFFSET          0x0080 /* SMC OCMS Mode Register */
#  define SAM_SMC_KEY1_OFFSET          0x0084 /* SMC KEY1 Register */
#  define SAM_SMC_KEY2_OFFSET          0x0088 /* SMC KEY2 Register */
#  define SAM_SMC_WPCR_OFFSET          0x00e4 /* Write Protection Control Register */
#  define SAM_SMC_WPSR_OFFSET          0x00e8 /* Write Protection Status Register */

#else
#  error Unrecognized SAM architecture
#endif

/* SMC register addresses ***************************************************************/

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SAM_SMC_CFG                  (SAM_SMC_BASE+SAM_SMC_CFG_OFFSET)
#  define SAM_SMC_CTRL                 (SAM_SMC_BASE+SAM_SMC_CTRL_OFFSET)
#  define SAM_SMC_SR                   (SAM_SMC_BASE+SAM_SMC_SR_OFFSET)
#  define SAM_SMC_IER                  (SAM_SMC_BASE+SAM_SMC_IER_OFFSET)
#  define SAM_SMC_IDR                  (SAM_SMC_BASE+SAM_SMC_IDR_OFFSET)
#  define SAM_SMC_IMR                  (SAM_SMC_BASE+SAM_SMC_IMR_OFFSET)
#  define SAM_SMC_ADDR                 (SAM_SMC_BASE+SAM_SMC_ADDR_OFFSET)
#  define SAM_SMC_BANK                 (SAM_SMC_BASE+SAM_SMC_BANK_OFFSET)
#  define SAM_SMC_ECCCTRL              (SAM_SMC_BASE+SAM_SMC_ECCCTRL_OFFSET)
#  define SAM_SMC_ECCMD                (SAM_SMC_BASE+SAM_SMC_ECCMD_OFFSET)
#  define SAM_SMC_ECCSR1               (SAM_SMC_BASE+SAM_SMC_ECCSR1_OFFSET)
#  define SAM_SMC_ECCPR0               (SAM_SMC_BASE+SAM_SMC_ECCPR0_OFFSET)
#  define SAM_SMC_ECCPR1               (SAM_SMC_BASE+SAM_SMC_ECCPR1_OFFSET)
#  define SAM_SMC_ECCSR2               (SAM_SMC_BASE+SAM_SMC_ECCSR2_OFFSET)
#  define SAM_SMC_ECCPR2               (SAM_SMC_BASE+SAM_SMC_ECCPR2_OFFSET)
#  define SAM_SMC_ECCPR3               (SAM_SMC_BASE+SAM_SMC_ECCPR3_OFFSET)
#  define SAM_SMC_ECCPR4               (SAM_SMC_BASE+SAM_SMC_ECCPR4_OFFSET)
#  define SAM_SMC_ECCPR5               (SAM_SMC_BASE+SAM_SMC_ECCPR5_OFFSET)
#  define SAM_SMC_ECCPR6               (SAM_SMC_BASE+SAM_SMC_ECCPR6_OFFSET)
#  define SAM_SMC_ECCPR7               (SAM_SMC_BASE+SAM_SMC_ECCPR7_OFFSET)
#  define SAM_SMC_ECCPR8               (SAM_SMC_BASE+SAM_SMC_ECCPR8_OFFSET)
#  define SAM_SMC_ECCPR9               (SAM_SMC_BASE+SAM_SMC_ECCPR9_OFFSET)
#  define SAM_SMC_ECCPR10              (SAM_SMC_BASE+SAM_SMC_ECCPR10_OFFSET)
#  define SAM_SMC_ECCPR11              (SAM_SMC_BASE+SAM_SMC_ECCPR11_OFFSET)
#  define SAM_SMC_ECCPR12              (SAM_SMC_BASE+SAM_SMC_ECCPR12_OFFSET)
#  define SAM_SMC_ECCPR13              (SAM_SMC_BASE+SAM_SMC_ECCPR13_OFFSET)
#  define SAM_SMC_ECCPR14              (SAM_SMC_BASE+SAM_SMC_ECCPR14_OFFSET)
#  define SAM_SMC_ECCPR15              (SAM_SMC_BASE+SAM_SMC_ECCPR15_OFFSET)
#endif

#define SAM_SMCCS_BASE(n)              (SAM_SMC_BASE+SAM_SMCCS_OFFSET(n))
#  define SAM_SMC_CS0_BASE             (SAM_SMC_BASE+SAM_SMCCS0_OFFSET)
#  define SAM_SMC_CS1_BASE             (SAM_SMC_BASE+SAM_SMCCS1_OFFSET)
#  define SAM_SMC_CS2_BASE             (SAM_SMC_BASE+SAM_SMCCS2_OFFSET)
#  define SAM_SMC_CS3_BASE             (SAM_SMC_BASE+SAM_SMCCS3_OFFSET)

