apache/nuttx/arch/arm/src/sam34/chip/sam_smc.h
/* SMC ECC Status Register 2 */

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SMC_ECCSR2_RECERR(n)         (1 << ((((n)-8)<<4)+_RECERR))
#  define SMC_ECCSR2_ECCERR(n)         (1 << ((((n)-8)<<4)+_ECCERR))
#  define SMC_ECCSR2_MULERR(n)         (1 << ((((n)-8)<<4)+_MULERR))

#  define SMC_ECCSR2_RECERR8           SMC_ECCSR2_RECERR(8)
#  define SMC_ECCSR2_ECCERR8           SMC_ECCSR2_ECCERR(8)
#  define SMC_ECCSR2_MULERR8           SMC_ECCSR2_MULERR(8)
#  define SMC_ECCSR2_RECERR9           SMC_ECCSR2_RECERR(9)
#  define SMC_ECCSR2_ECCERR9           SMC_ECCSR2_ECCERR(9)
#  define SMC_ECCSR2_MULERR9           SMC_ECCSR2_MULERR(9)
#  define SMC_ECCSR2_RECERR10          SMC_ECCSR2_RECERR(10)
#  define SMC_ECCSR2_ECCERR10          SMC_ECCSR2_ECCERR(10)
#  define SMC_ECCSR2_MULERR10          SMC_ECCSR2_MULERR(10)
#  define SMC_ECCSR2_RECERR11          SMC_ECCSR2_RECERR(11)
#  define SMC_ECCSR2_ECCERR11          SMC_ECCSR2_ECCERR(11)
#  define SMC_ECCSR2_MULERR11          SMC_ECCSR2_MULERR(11)
#  define SMC_ECCSR2_RECERR12          SMC_ECCSR2_RECERR(12)
#  define SMC_ECCSR2_ECCERR12          SMC_ECCSR2_ECCERR(12)
#  define SMC_ECCSR2_MULERR12          SMC_ECCSR2_MULERR(12)
#  define SMC_ECCSR2_RECERR13          SMC_ECCSR2_RECERR(13)
#  define SMC_ECCSR2_ECCERR13          SMC_ECCSR2_ECCERR(13)
#  define SMC_ECCSR2_MULERR13          SMC_ECCSR2_MULERR(13)
#  define SMC_ECCSR1_RECERR14          SMC_ECCSR2_RECERR(14)
#  define SMC_ECCSR1_ECCERR14          SMC_ECCSR2_ECCERR(14)
#  define SMC_ECCSR1_MULERR14          SMC_ECCSR2_MULERR(14)
#  define SMC_ECCSR1_RECERR15          SMC_ECCSR2_RECERR(15)
#  define SMC_ECCSR1_ECCERR15          SMC_ECCSR2_ECCERR(15)
#  define SMC_ECCSR1_MULERR15          SMC_ECCSR2_MULERR(15)
#endif

/* Registers for 1 ECC for a page of 512/1024/2048/4096 bytes */
/* SMC_ECC_PR0 */

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SMC_ECCPR0_BITADDR_SHIFT     (0)       /* Bits 0-3: Bit Address */
#  define SMC_ECCPR0_BITADDR_MASK      (15 << SMC_ECCPR0_BITADDR_SHIFT)
#  define SMC_ECCPR0_WORDADDR_SHIFT    (4)       /* Bits 4-15: Word Address */
#  define SMC_ECCPR0_WORDADDR_MASK     (0xfff << SMC_ECCPR0_WORDADDR_SHIFT)

#ifdef CONFIG_ARCH_CHIP_SAM3U
#  define SMC_ECCPR1_NPARITY_SHIFT     (0)       /* Bits 0-15 */
#  define SMC_ECCPR1_NPARITY_MASK      (0xffff << SMC_ECCPR1_NPARITY_SHIFT)
#endif
#endif

/* Registers for 1 ECC per 512 bytes for a page of 512/2048/4096 bytes, 8-bit word */

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SMC_ECCPR512_BITADDR_SHIFT   (0)       /* Bits 0-3: Bit Address */
#  define SMC_ECCPR512_BITADDR_MASK    (15 << SMC_ECCPR512_BITADDR_SHIFT)
#  define SMC_ECCPR512_WORDADDR_SHIFT  (4)       /* Bits 4-15: Word Address */
#  define SMC_ECCPR512_WORDADDR_MASK   (0xfff << SMC_ECCPR512_WORDADDR_SHIFT)
#  define SMC_ECCPR512_NPARITY_SHIFT   (12)      /* Bits 12-23 (or is it 31?) */
#  define SMC_ECCPR512_NPARITY_MASK    (0xfff << SMC_ECCPR512_NPARITY_SHIFT)
#endif

/* Registers for 1 ECC per 256 bytes for a page of 512/2048/4096 bytes, 8-bit word */

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SMC_ECCPR256_BITADDR_SHIFT   (0)       /* Bits 0-2: Bit Address */
#  define SMC_ECCPR256_BITADDR_MASK    (7 << SMC_ECCPR256_BITADDR_SHIFT)
#  define SMC_ECCPR256_WORDADDR_SHIFT  (4)       /* Bits 4-10: Word Address */
#  define SMC_ECCPR256_WORDADDR_MASK   (0x7f << SMC_ECCPR256_WORDADDR_SHIFT)
#  define SMC_ECCPR256_NPARITY_SHIFT   (12)      /* Bits 12-22 */
#  define SMC_ECCPR256_NPARITY_MASK    (0x7ff << SMC_ECCPR256_NPARITY_SHIFT)
#endif

/* SMC Setup Register */

#define SMCCS_SETUP_NWESETUP_SHIFT     (0)       /* Bits 0-5: NWE Setup length */
#define SMCCS_SETUP_NWESETUP_MASK      (63 << SMCCS_SETUP_NWESETUP_SHIFT)
#  define SMCCS_SETUP_NWESETUP(n)      ((n) << SMCCS_SETUP_NWESETUP_SHIFT)
#define SMCCS_SETUP_NCSWRSETUP_SHIFT   (8)       /* Bits 8-13: NCS Setup length in Write access */
#define SMCCS_SETUP_NCSWRSETUP_MASK    (63 << SMCCS_SETUP_NCSWRSETUP_SHIFT)
#  define SMCCS_SETUP_NCSWRSETUP(n)    ((n) << SMCCS_SETUP_NCSWRSETUP_SHIFT)
#define SMCCS_SETUP_NRDSETUP_SHIFT     (16)      /* Bits 16-21: NRD Setup length */
#define SMCCS_SETUP_NRDSETUP_MASK      (63 << SMCCS_SETUP_NRDSETUP_SHIFT)
#  define SMCCS_SETUP_NRDSETUP(n)      ((n) << SMCCS_SETUP_NRDSETUP_SHIFT)
#define SMCCS_SETUP_NCSRDSETUP_SHIFT   (24)      /* Bits 24-29: NCS Setup length in Read access */
#define SMCCS_SETUP_NCSRDSETUP_MASK    (63 << SMCCS_SETUP_NCSRDSETUP_SHIFT)
#  define SMCCS_SETUP_NCSRDSETUP(n)    ((n) << SMCCS_SETUP_NCSRDSETUP_SHIFT)

/* SMC Pulse Register */

#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SMCCS_PULSE_NWEPULSE_SHIFT   (0)       /* Bits 0-6: NWE Pulse Length */
#  define SMCCS_PULSE_NWEPULSE_MASK    (127 << SMCCS_PULSE_NWEPULSE_SHIFT)
#    define SMCCS_PULSE_NWEPULSE(n)    ((n) << SMCCS_PULSE_NWEPULSE_SHIFT)
#  define SMCCS_PULSE_NCSWRPULSE_SHIFT (8)       /* Bits 8-14: NCS Pulse Length in WRITE Access */
#  define SMCCS_PULSE_NCSWRPULSE_MASK  (127 << SMCCS_PULSE_NCSWRPULSE_SHIFT)
#    define SMCCS_PULSE_NCSWRPULSE(n)  ((n) << SMCCS_PULSE_NCSWRPULSE_SHIFT)
#  define SMCCS_PULSE_NRDPULSE_SHIFT   (16)      /* Bits 16-22: NRD Pulse Length */
#  define SMCCS_PULSE_NRDPULSE_MASK    (127 << SMCCS_PULSE_NRDPULSE_SHIFT)
#    define SMCCS_PULSE_NRDPULSE(n)    ((n) << SMCCS_PULSE_NRDPULSE_SHIFT)
#  define SMCCS_PULSE_NCSRDPULSE_SHIFT (24)      /* Bits 24-30: NCS Pulse Length in READ Access */
#  define SMCCS_PULSE_NCSRDPULSE_MASK  (127 << SMCCS_PULSE_NCSRDPULSE_SHIFT)
#    define SMCCS_PULSE_NCSRDPULSE(n)  ((n) << SMCCS_PULSE_NCSRDPULSE_SHIFT)
#else
#  define SMCCS_PULSE_NWEPULSE_SHIFT   (0)       /* Bits 0-5: NWE Pulse Length */
#  define SMCCS_PULSE_NWEPULSE_MASK    (63 << SMCCS_PULSE_NWEPULSE_SHIFT)
#    define SMCCS_PULSE_NWEPULSE(n)    ((n) << SMCCS_PULSE_NWEPULSE_SHIFT)
#  define SMCCS_PULSE_NCSWRPULSE_SHIFT (8)       /* Bits 8-13: NCS Pulse Length in WRITE Access */
#  define SMCCS_PULSE_NCSWRPULSE_MASK  (63 << SMCCS_PULSE_NCSWRPULSE_SHIFT)
#    define SMCCS_PULSE_NCSWRPULSE(n)  ((n) << SMCCS_PULSE_NCSWRPULSE_SHIFT)
#  define SMCCS_PULSE_NRDPULSE_SHIFT   (16)      /* Bits 16-21: NRD Pulse Length */
#  define SMCCS_PULSE_NRDPULSE_MASK    (63 << SMCCS_PULSE_NRDPULSE_SHIFT)
#    define SMCCS_PULSE_NRDPULSE(n)    ((n) << SMCCS_PULSE_NRDPULSE_SHIFT)
#  define SMCCS_PULSE_NCSRDPULSE_SHIFT (24)      /* Bits 24-29: NCS Pulse Length in READ Access */
#  define SMCCS_PULSE_NCSRDPULSE_MASK  (63 << SMCCS_PULSE_NCSRDPULSE_SHIFT)
#    define SMCCS_PULSE_NCSRDPULSE(n)  ((n) << SMCCS_PULSE_NCSRDPULSE_SHIFT)
#endif

/* SMC Cycle Register */

#define SMCCS_CYCLE_NWECYCLE_SHIFT     (0)       /* Bits 0-8: Total Write Cycle Length */
#define SMCCS_CYCLE_NWECYCLE_MASK      (0x1ff << SMCCS_CYCLE_NWECYCLE_SHIFT)
#  define SMCCS_CYCLE_NWECYCLE(n)      ((n) << SMCCS_CYCLE_NWECYCLE_SHIFT)
#define SMCCS_CYCLE_NRDCYCLE_SHIFT     (16)      /* Bits 16-24: Total Read Cycle Length */
#define SMCCS_CYCLE_NRDCYCLE_MASK      (0x1ff << SMCCS_CYCLE_NRDCYCLE_SHIFT)
#  define SMCCS_CYCLE_NRDCYCLE(n)      ((n) << SMCCS_CYCLE_NRDCYCLE_SHIFT)

/* SMC Timings Register */

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SMCCS_TIMINGS_TCLR_SHIFT     (0)       /* Bits 0-3: CLE to REN Low Delay */
#  define SMCCS_TIMINGS_TCLR_MASK      (15 << SMCCS_TIMINGS_TCLR_SHIFT)
#  define SMCCS_TIMINGS_TADL_SHIFT     (4)       /* Bits 4-7: ALE to Data Start */
#  define SMCCS_TIMINGS_TADL_MASK      (15 << SMCCS_TIMINGS_TADL_SHIFT)
#  define SMCCS_TIMINGS_TAR_SHIFT      (8)       /* Bits 8-11: ALE to REN Low Delay */
#  define SMCCS_TIMINGS_TAR_MASK       (15 << SMCCS_TIMINGS_TAR_SHIFT)
#  define SMCCS_TIMINGS_OCMS           (1 << 12) /* Bit 12: Off Chip Memory Scrambling Enable */
#  define SMCCS_TIMINGS_TRR_SHIFT      (16)      /* Bits 16-19: Ready to REN Low Delay */
#  define SMCCS_TIMINGS_TRR_MASK       (15 << SMCCS_TIMINGS_TRR_SHIFT)
#  define SMCCS_TIMINGS_TWB_SHIFT      (24)      /* Bits 24-27: WEN High to REN to Busy */
#  define SMCCS_TIMINGS_TWB_MASK       (15 << SMCCS_TIMINGS_TWB_SHIFT)
#  define SMCCS_TIMINGS_RBNSEL_SHIFT   (28)      /* Bits 28-30: Ready/Busy Line Selection */
#  define SMCCS_TIMINGS_RBNSEL_MASK    (7 << SMCCS_TIMINGS_RBNSEL_SHIFT)
#  define SMCCS_TIMINGS_NFSEL          (1 << 31) /* Bit 31: NAND Flash Selection */
#endif

/* SMC Mode Register */

#define SMCCS_MODE_READMODE            (1 << 0)  /* Bit 0: Read mode */
#define SMCCS_MODE_WRITEMODE           (1 << 1)  /* Bit 1: Write mode */
#define SMCCS_MODE_EXNWMODE_SHIFT      (4)       /* Bits 4-5: NWAIT Mode */
#define SMCCS_MODE_EXNWMODE_MASK       (3 << SMCCS_MODE_EXNWMODE_SHIFT)
#  define SMCCS_EXNWMODE_DISABLED      (0 << SMCCS_MODE_EXNWMODE_SHIFT)
#  define SMCCS_EXNWMODE_FROZEN        (2 << SMCCS_MODE_EXNWMODE_SHIFT)
#  define SMCCS_EXNWMODE_READY         (3 << SMCCS_MODE_EXNWMODE_SHIFT)

#if defined(CONFIG_ARCH_CHIP_SAM3U) || defined(CONFIG_ARCH_CHIP_SAM3X) || \
    defined(CONFIG_ARCH_CHIP_SAM3A)
#  define SMCCS_MODE_BAT               (1 << 8)  /* Bit 8:  Byte Access Type */
#  define SMCCS_MODE_DBW_SHIFT         (12)      /* Bits 12-13: Data Bus Width */
#  define SMCCS_MODE_DBW_MASK          (3 << SMCCS_MODE_DBW_SHIFT)
#    define SMCCS_MODE_DBW_8BITS       (0 << 12) /* 8 bits */
#    define SMCCS_MODE_DBW_16BITS      (1 << 12) /* 16 bits */
#    define SMCCS_MODE_DBW_32BITS      (2 << 12) /* 32 bits */
#endif

